# -*- fill-column: 76; -*-
#+Title: Benchmark proposed page_pool DMA tracking fixes
#+OPTIONS: ^:nil

* Document index (autogenerated)  :toc:
- [[#patchset][Patchset]]
- [[#bench-a-on-e5-1650-bench_page_pool_simple][Bench-A on E5-1650: bench_page_pool_simple]]
  - [[#baseline-before-patchset][baseline: Before patchset]]
  - [[#pp01-dma-fix-v7][pp01-DMA-fix-v7]]
  - [[#summary-cpu-e5-1650][Summary: CPU E5-1650]]
- [[#bench-b-on-e5-1650-patchset-1-5][Bench-B on E5-1650: patchset 1-5]]
- [[#practical][Practical]]
  - [[#building-benchmark][Building benchmark]]

* Patchset

[PATCH net-next v7 0/8] fix two bugs related to page_pool
 - https://lore.kernel.org/all/20250110130703.3814407-1-linyunsheng@huawei.com/

* Bench-A on E5-1650: bench_page_pool_simple

Machine:
 - Hostname: broadwell
 - CPU: Intel(R) Xeon(R) CPU E5-1650 v4 @ 3.60GHz

Benchmark:
 - Load kernel module: [[https://github.com/netoptimizer/prototype-kernel/blob/master/kernel/lib/bench_page_pool_simple.c][bench_page_pool_simple]]
 - https://github.com/netoptimizer/prototype-kernel/blob/master/kernel/lib/bench_page_pool_simple.c

** baseline: Before patchset

Before this patchset:

Kernel:
 - 6.13.0-rc6baseline+ #3 SMP PREEMPT_DYNAMIC Mon Jan 13 12:37:00 CET 2025 x86_64 GNU/Linux
 - based net-next commit: 7b24f164cf005b9649

Increase the loops variable for longer test:
 - modprobe bench_page_pool_simple loops=100000000

Raw data:
#+begin_example
[  157.186644] bench_page_pool_simple: Loaded
[  157.475084] time_bench: Type:for_loop Per elem: 1 cycles(tsc) 0.284 ns (step:0) - (measurement period time:0.284327440 sec time_interval:284327440) - (invoke count:1000000000 tsc_interval:1023590451)
[  162.262752] time_bench: Type:atomic_inc Per elem: 17 cycles(tsc) 4.769 ns (step:0) - (measurement period time:4.769757001 sec time_interval:4769757001) - (invoke count:1000000000 tsc_interval:17171776113)
[  163.324091] time_bench: Type:lock Per elem: 37 cycles(tsc) 10.431 ns (step:0) - (measurement period time:1.043182161 sec time_interval:1043182161) - (invoke count:100000000 tsc_interval:3755514465)
[  163.341702] bench_page_pool_simple: time_bench_page_pool01_fast_path(): Cannot use page_pool fast-path
[  163.922466] time_bench: Type:no-softirq-page_pool01 Per elem: 20 cycles(tsc) 5.713 ns (step:0) - (measurement period time:0.571357387 sec time_interval:571357387) - (invoke count:100000000 tsc_interval:2056911063)
[  163.941429] bench_page_pool_simple: time_bench_page_pool02_ptr_ring(): Cannot use page_pool fast-path
[  165.506796] time_bench: Type:no-softirq-page_pool02 Per elem: 56 cycles(tsc) 15.560 ns (step:0) - (measurement period time:1.556080558 sec time_interval:1556080558) - (invoke count:100000000 tsc_interval:5601960921)
[  165.525978] bench_page_pool_simple: time_bench_page_pool03_slow(): Cannot use page_pool fast-path
[  171.811289] time_bench: Type:no-softirq-page_pool03 Per elem: 225 cycles(tsc) 62.763 ns (step:0) - (measurement period time:6.276301531 sec time_interval:6276301531) - (invoke count:100000000 tsc_interval:22594974468)
[  171.830646] bench_page_pool_simple: pp_tasklet_handler(): in_serving_softirq fast-path
[  171.838561] bench_page_pool_simple: time_bench_page_pool01_fast_path(): in_serving_softirq fast-path
[  172.387597] time_bench: Type:tasklet_page_pool01_fast_path Per elem: 19 cycles(tsc) 5.399 ns (step:0) - (measurement period time:0.539904228 sec time_interval:539904228) - (invoke count:100000000 tsc_interval:1943679246)
[  172.407130] bench_page_pool_simple: time_bench_page_pool02_ptr_ring(): in_serving_softirq fast-path
[  173.925266] time_bench: Type:tasklet_page_pool02_ptr_ring Per elem: 54 cycles(tsc) 15.090 ns (step:0) - (measurement period time:1.509075496 sec time_interval:1509075496) - (invoke count:100000000 tsc_interval:5432740575)
[  173.944878] bench_page_pool_simple: time_bench_page_pool03_slow(): in_serving_softirq fast-path
[  180.567094] time_bench: Type:tasklet_page_pool03_slow Per elem: 238 cycles(tsc) 66.134 ns (step:0) - (measurement period time:6.613430605 sec time_interval:6613430605) - (invoke count:100000000 tsc_interval:23808654870)
#+end_example

** pp01-DMA-fix-v7

Applied patchset v7.
 - [PATCH net-next v7 0/8] fix two bugs related to page_pool
 - https://lore.kernel.org/all/20250110130703.3814407-1-linyunsheng@huawei.com/

Self-notes to locate kernel tree:
 - Host: firesoul
 - Dirs: ~/git/kernel/net-next3
 - Branch: pp01-DMA-fix-v7

Kernel:
 - 6.13.0-rc6-pp01-DMA-fix-v7+ #4 SMP PREEMPT_DYNAMIC Mon Jan 13 15:27:09 CET 2025 x86_64 GNU/Linux

#+begin_example
[  860.519918] bench_page_pool_simple: Loaded
[  860.781605] time_bench: Type:for_loop Per elem: 0 cycles(tsc) 0.257 ns (step:0) - (measurement period time:0.257573336 sec time_interval:257573336) - (invoke count:1000000000 tsc_interval:927275355)
[  865.613893] time_bench: Type:atomic_inc Per elem: 17 cycles(tsc) 4.814 ns (step:0) - (measurement period time:4.814593429 sec time_interval:4814593429) - (invoke count:1000000000 tsc_interval:17332768494)
[  866.708420] time_bench: Type:lock Per elem: 38 cycles(tsc) 10.763 ns (step:0) - (measurement period time:1.076362960 sec time_interval:1076362960) - (invoke count:100000000 tsc_interval:3874955595)
[  866.726118] bench_page_pool_simple: time_bench_page_pool01_fast_path(): Cannot use page_pool fast-path
[  867.423572] time_bench: Type:no-softirq-page_pool01 Per elem: 24 cycles(tsc) 6.880 ns (step:0) - (measurement period time:0.688069107 sec time_interval:688069107) - (invoke count:100000000 tsc_interval:2477080260)
[  867.442517] bench_page_pool_simple: time_bench_page_pool02_ptr_ring(): Cannot use page_pool fast-path
[  869.436286] time_bench: Type:no-softirq-page_pool02 Per elem: 71 cycles(tsc) 19.844 ns (step:0) - (measurement period time:1.984451929 sec time_interval:1984451929) - (invoke count:100000000 tsc_interval:7144120329)
[  869.455492] bench_page_pool_simple: time_bench_page_pool03_slow(): Cannot use page_pool fast-path
[  877.071437] time_bench: Type:no-softirq-page_pool03 Per elem: 273 cycles(tsc) 76.069 ns (step:0) - (measurement period time:7.606911291 sec time_interval:7606911291) - (invoke count:100000000 tsc_interval:27385252251)
[  877.090762] bench_page_pool_simple: pp_tasklet_handler(): in_serving_softirq fast-path
[  877.098683] bench_page_pool_simple: time_bench_page_pool01_fast_path(): in_serving_softirq fast-path
[  877.800696] time_bench: Type:tasklet_page_pool01_fast_path Per elem: 24 cycles(tsc) 6.928 ns (step:0) - (measurement period time:0.692852876 sec time_interval:692852876) - (invoke count:100000000 tsc_interval:2494303293)
[  877.820224] bench_page_pool_simple: time_bench_page_pool02_ptr_ring(): in_serving_softirq fast-path
[  880.026911] time_bench: Type:tasklet_page_pool02_ptr_ring Per elem: 79 cycles(tsc) 21.976 ns (step:0) - (measurement period time:2.197615122 sec time_interval:2197615122) - (invoke count:100000000 tsc_interval:7911521190)
[  880.046528] bench_page_pool_simple: time_bench_page_pool03_slow(): in_serving_softirq fast-path
[  888.385235] time_bench: Type:tasklet_page_pool03_slow Per elem: 299 cycles(tsc) 83.298 ns (step:0) - (measurement period time:8.329893717 sec time_interval:8329893717) - (invoke count:100000000 tsc_interval:29988024696)
#+end_example

** Summary: CPU E5-1650

Benchmark (bench_page_pool_simple) results from before and after patchset.

| Test name   | Cycles |       |      | Nanosec |        |        |      % |
| (tasklet_*) | Before | After | diff |  Before |  After |   diff | change |
|-------------+--------+-------+------+---------+--------+--------+--------|
| fast_path   |     19 |    24 |    5 |   5.399 |  6.928 |  1.529 |   28.3 |
| ptr_ring    |     54 |    79 |   25 |  15.090 | 21.976 |  6.886 |   45.6 |
| slow        |    238 |   299 |   61 |  66.134 | 83.298 | 17.164 |   26.0 |
#+TBLFM: $4=$3-$2::$7=$6-$5::$8=(($7/$5)*100);%.1f

* Bench-B on E5-1650: patchset 1-5

Benchmark as requested in:
 - https://lore.kernel.org/all/1bef4a35-efaa-4083-8ed5-8818fe285db5@huawei.com/

Benchmark only patches 1-5
 - From v7: https://lore.kernel.org/all/20250110130703.3814407-1-linyunsheng@huawei.com/

And also remove the =rcu_read_lock= / =rcu_read_unlock= in =page_pool_napi_local=.

#+begin_src C
--- a/net/core/page_pool.c
+++ b/net/core/page_pool.c
@@ -1207,10 +1207,8 @@ static bool page_pool_napi_local(const struct page_pool *pool)
        /* Synchronizated with page_pool_destory() to avoid use-after-free
         * for 'napi'.
         */
-       rcu_read_lock();
        napi = READ_ONCE(pool->p.napi);
        napi_local = napi && READ_ONCE(napi->list_owner) == cpuid;
-       rcu_read_unlock();

        return napi_local;
 }
#+end_src


* Practical

** Building benchmark

#+begin_src sh
  cd ~/git/prototype-kernel/kernel/
  make kbuilddir=~/git/kernel/net-next3 -j12
  make push_remote kbuilddir=~/git/kernel/net-next3/ HOST=bro
#+end_src
